In [1]:
# Preprocesses Beals property spreadsheet - updates property ids

In [2]:
import csv
import pandas as pd
pd.options.mode.chained_assignment = None  # default='warn

In [3]:
dir = 'E:/dtuklaptop/e/Users/Mat/python/data/property/'
#dir = 'M:/My Documents/Business/Property/Statements/working/testenvironment/'
input_file = dir + 'ValentinoMay22.csv'
output_file = dir + 'ValentinoMay22_output.csv'
#df = pd.read_csv(input_file, delimiter=',', parse_dates=['Date Created'])
df = pd.read_csv(input_file, delimiter=',', parse_dates=['Date Created'], dayfirst=True)
df['ID'] = df['ID'].str.strip()
df.head(5)

,ID,Activity I D,Date Created,Item Description,Uploaded Invoice,Lettings Charge Group I D,Document Type,Document Number,Grouped Amount,Shared Html,Debit Amount,Credit Amount
0,"Flat 7, 8 Alhambra Road, Southsea",885988,2022-05-04 14:37:00,Rent for period 30/04/2022 - 29/05/2022 from M...,NaN,NaN,NaN,0,NaN,NaN,0.0,500.00
1,"Flat 7, 8 Alhambra Road, Southsea",885988,2022-05-04 14:37:00,"Management Fee at 7% - Flat 7, 8 Alhambra Road...",NaN,NaN,Invoice,349930,NaN,NaN,42.0,0.00
2,"Flat 7, 8 Alhambra Road, Southsea",886021,2022-05-04 14:40:00,"Amount payable to Ms Ivana Valentino - Flat 7,...",NaN,NaN,Statement,263750,NaN,NaN,452.0,0.00
3,"Flat 7, 8 Alhambra Road, Southsea",890834,2022-05-28 00:32:00,"Legislation & Compliance - Flat 7, 8 Alhambra...",NaN,NaN,Invoice,353037,NaN,NaN,6.0,0.00
4,"Flat 3, 12-14 Alhambra Road, Southsea",891405,2022-05-31 11:49:00,"Deposit to landlord for damage, decoration & c...",NaN,NaN,NaN,0,NaN,NaN,0.0,328.84

In [4]:
df['ID'].loc[df['ID'] == 'F10, 12-14 ALH'] = 'F101214ALH'
df['ID'].loc[df['ID'] == 'Flat 10 12-14 Alhambra Road'] = 'F101214ALH'
df['ID'].loc[df['ID'] == 'F14, 12-14 ALH'] = 'F141214ALH'
df['ID'].loc[df['ID'] == 'Flat 14 12-14 Alhambra Road'] = 'F141214ALH'
df['ID'].loc[df['ID'] == 'F4, 12-14 ALH'] = 'F41214ALH'
df['ID'].loc[df['ID'] == 'Flat 4 12-14 Alhambra Road'] = 'F41214ALH'
df['ID'].loc[df['ID'] == 'F6, 16-18 ALH'] = 'F61618ALH'
df['ID'].loc[df['ID'] == 'Flat 6 16-18 Alhambra Road'] = 'F61618ALH'
df['ID'].loc[df['ID'] == 'Flat 6, 16-18 Alhambra Road'] = 'F61618ALH'
df['ID'].loc[df['ID'] == 'F11, 16-18 ALH'] = 'F111618ALH'
df['ID'].loc[df['ID'] == 'Flat 11 16-18 Alhambra Road'] = 'F111618ALH'
df['ID'].loc[df['ID'] == 'F13, 16-18 ALH'] = 'F131618ALH'
df['ID'].loc[df['ID'] == 'Flat 13 16-18 Alhambra Road'] = 'F131618ALH'
df['ID'].loc[df['ID'] == 'Flat 13, 16-18 Alhambra Road'] = 'F131618ALH'
df['ID'].loc[df['ID'] == 'F1, 321 LON'] = 'F1321LON'
df['ID'].loc[df['ID'] == 'F1, 321 LON'] = 'F1321LON'
df['ID'].loc[df['ID'] == 'Flat 1 321 London Road'] = 'F1321LON'
df['ID'].loc[df['ID'] == 'F3, 321 LON'] = 'F3321LON'
df['ID'].loc[df['ID'] == 'F4, 321 LON'] = 'F4321LON'
df['ID'].loc[df['ID'] == 'Flat 4 321 London Road'] = 'F4321LON'
df['ID'].loc[df['ID'] == 'Flat 1 171 Fawcett Road'] = 'F1171FAW'
df['ID'].loc[df['ID'] == 'F2, 171 FAW'] = 'F2171FAW'
df['ID'].loc[df['ID'] == 'Flat 2 171 Fawcett Road'] = 'F2171FAW'
df['ID'].loc[df['ID'] == 'F3, 169 FAW'] = 'F3169FAW'
df['ID'].loc[df['ID'] == 'Flat 3 169 Fawcett Road'] = 'F3169FAW'
df['ID'].loc[df['ID'] == 'F1, 169 FAW'] = 'F1169FAW'
df['ID'].loc[df['ID'] == 'Flat 1 169 Fawcett Road'] = 'F1169FAW'
df['ID'].loc[df['ID'] == 'Shop, 196 KIN'] = 'SHOP196KIN'
df['ID'].loc[df['ID'] == 'Shop 196 Kingston Road'] = 'SHOP196KIN'
df['ID'].loc[df['ID'] == '196A KIN'] = '196AKIN'
df['ID'].loc[df['ID'] == '196a Kingston Road'] = '196AKIN'
df['ID'].loc[df['ID'] == 'F6, 8 ALH'] = 'F68ALH'
df['ID'].loc[df['ID'] == 'Flat 6 8 Alhambra Road'] = 'F68ALH'
df['ID'].loc[df['ID'] == 'Flat 6, 8 Alhambra Road'] = 'F68ALH'
df['ID'].loc[df['ID'] == 'F3, 163 FRATT'] = 'F3163FRA'
df['ID'].loc[df['ID'] == 'F3, 163 FRAT'] = 'F3163FRA'
df['ID'].loc[df['ID'] == 'Flat 3 163 Fratton Road'] = 'F3163FRA'
df['ID'].loc[df['ID'] == 'F7, 12-14 ALH'] = 'F71214ALH'
df['ID'].loc[df['ID'] == 'Flat 7 12-14 Alhambra Road'] = 'F71214ALH'
df['ID'].loc[df['ID'] == 'Flat 7 12 - 14 Alhambra Road'] = 'F71214ALH'
df['ID'].loc[df['ID'] == 'F1, 171 FAW'] = 'F1171FAW'
df['ID'].loc[df['ID'] == 'Flat 1 171 Fawcett Road'] = 'F1171FAW'
df['ID'].loc[df['ID'] == 'F7, 8 ALH'] = 'F78ALH'
df['ID'].loc[df['ID'] == 'Flat 7 8 Alhambra Road'] = 'F78ALH'
df['ID'].loc[df['ID'] == 'F3, 12-14 ALH'] = 'F31214ALH'
df['ID'].loc[df['ID'] == 'Flat 3 12-14 Alhambra Road'] = 'F31214ALH'
df['ID'].loc[df['ID'] == 'Flat 3, 12-14 Alhambra Road'] = 'F31214ALH'
df['ID'].loc[df['ID'] == 'F5, 12-14 ALH'] = 'F51214ALH'
df['ID'].loc[df['ID'] == 'Flat 5 12-14 Alhambra Road'] = 'F51214ALH'
df['ID'].loc[df['ID'] == 'F16, 12-14 ALH'] = 'F161214ALH'
df['ID'].loc[df['ID'] == 'Flat 16 12-14 Alhambra Road'] = 'F161214ALH'
df['ID'].loc[df['ID'] == 'Flat 16, 12-14 Alhambra Road'] = 'F161214ALH'
df['ID'].loc[df['ID'] == 'F12, 16-18 ALH'] = 'F121618ALH'
df['ID'].loc[df['ID'] == 'Flat 12 16-18 Alhambra Road'] = 'F121618ALH'
df['ID'].loc[df['ID'] == 'Flat 12, 16-18 Alhambra Road'] = 'F121618ALH'
df['ID'].loc[df['ID'] == 'F16, 16-18 ALH'] = 'F161618ALH'
df['ID'].loc[df['ID'] == 'Flat 16 16-18 Alhambra Road'] = 'F161618ALH'
df['ID'].loc[df['ID'] == 'Flat 16, 16-18 Alhambra Roa'] = 'F161618ALH'
df['ID'].loc[df['ID'] == 'SHOP, 196 KIN'] = 'SHOP196KIN'
df['ID'].loc[df['ID'] == 'Shop, 196 Kingston Road'] = 'SHOP196KIN'
df['ID'].loc[df['ID'] == '196 Kingston Road, Shop'] = 'SHOP196KIN'

df['ID'].loc[df['ID'] == 'Flat 20, 4-6 Alhambra Road'] = 'F2046ALH'
df['ID'].loc[df['ID'] == 'Flat 20, 4-6 Alhambra'] = 'F2046ALH'
df['ID'].loc[df['ID'] == 'Flat 19, 4-6 Alhambra Road'] = 'F1946ALH'
df['ID'].loc[df['ID'] == 'Flat 19, 4-6 Alhambra'] = 'F1946ALH'
df['ID'].loc[df['ID'] == 'Flat 18, 4-6 Alhambra Road'] = 'F1846ALH'
df['ID'].loc[df['ID'] == 'Flat 18, 4-6 Ahambra Road'] = 'F1846ALH'
df['ID'].loc[df['ID'] == 'Flat 10, 12-14 Alhambra Road'] = 'F101214ALH'
df['ID'].loc[df['ID'] == 'Flat 14, 12-14 Alhambra Road'] = 'F141214ALH'
df['ID'].loc[df['ID'] == 'Flat 11, 16-18 Alhambra Road'] = 'F111618ALH'
df['ID'].loc[df['ID'] == 'Flat 1, 321 London Road'] = 'F1321LON'
df['ID'].loc[df['ID'] == 'Flat 4, 321 London Road'] = 'F4321LON'
df['ID'].loc[df['ID'] == 'Flat 2, 171 Fawcett Road'] = 'F2171FAW'
df['ID'].loc[df['ID'] == 'Flat 3, 169 Fawcett Road'] = 'F3169FAW'
df['ID'].loc[df['ID'] == 'Flat 1, 169 Fawcett Road'] = 'F1169FAW'
df['ID'].loc[df['ID'] == 'Flat 3, 163 Fratton Road'] = 'F3163FRA'
df['ID'].loc[df['ID'] == 'Flat 7, 12-14 Alhambra Road'] = 'F71214ALH'
df['ID'].loc[df['ID'] == 'Flat 1, 171 Fawcett Road'] = 'F1171FAW'
df['ID'].loc[df['ID'] == 'Flat 4, 12-14 Alhambra Road'] = 'F41214ALH'
df['ID'].loc[df['ID'] == 'Flat 6, 16-18 Alhambra Roa'] = 'F61618ALH'

df['ID'].loc[df['ID'] == 'Flat 20, 4-6 Alhambra Road, Southsea'] = 'F2046ALH'
df['ID'].loc[df['ID'] == 'Flat 19, 4-6 Alhambra Road, Southsea'] = 'F1946ALH'
df['ID'].loc[df['ID'] == 'Flat 18, 4-6 Alhambra Road, Southsea'] = 'F1846ALH'
df['ID'].loc[df['ID'] == 'Flat 10, 12-14 Alhambra Road, Southsea'] = 'F101214ALH'
df['ID'].loc[df['ID'] == 'Flat 14, 12-14 Alhambra Road, Southsea'] = 'F141214ALH'
df['ID'].loc[df['ID'] == 'Flat 11, 16-18 Alhambra Road, Southsea'] = 'F111618ALH'
df['ID'].loc[df['ID'] == 'Flat 1, 321 London Road, Portsmouth'] = 'F1321LON'
df['ID'].loc[df['ID'] == 'Flat 4, 321 London Road, Portsmouth'] = 'F4321LON'
df['ID'].loc[df['ID'] == 'Flat 2, 171 Fawcett Road, Southsea'] = 'F2171FAW'
df['ID'].loc[df['ID'] == 'Flat 3, 169 Fawcett Road, Southsea'] = 'F3169FAW'
df['ID'].loc[df['ID'] == 'Flat 1, 169 Fawcett Road, Southsea'] = 'F1169FAW'
df['ID'].loc[df['ID'] == 'Flat 3, 163 Fratton Road, Southsea'] = 'F3163FRA'
df['ID'].loc[df['ID'] == 'Flat 7, 12-14 Alhambra Road, Southsea'] = 'F71214ALH'
df['ID'].loc[df['ID'] == 'Flat 1, 171 Fawcett Road, Southsea'] = 'F1171FAW'
df['ID'].loc[df['ID'] == 'Flat 4, 12-14 Alhambra Road, Southsea'] = 'F41214ALH'
df['ID'].loc[df['ID'] == 'Flat 6, 16-18 Alhambra Road, Southsea'] = 'F61618ALH'

df['ID'].loc[df['ID'] == 'Shop, 196 Kingston Road, Portsmouth'] = 'SHOP196KIN'
df['ID'].loc[df['ID'] == '196a Kingston Road, Portsmouth'] = '196AKIN'
df['ID'].loc[df['ID'] == 'Flat 6, 8 Alhambra Road, Southsea'] = 'F68ALH'
df['ID'].loc[df['ID'] == 'Flat 3, 163 Fratton Road, Portsmouth'] = 'F3163FRA'

df['ID'].loc[df['ID'] == 'Flat 7, 8 Alhambra Road, Southsea'] = 'F78ALH'
df['ID'].loc[df['ID'] == 'Flat 3, 12-14 Alhambra Road, Southsea'] = 'F31214ALH'
df['ID'].loc[df['ID'] == 'Flat 5, 12-14 Alhambra Road, Southsea'] = 'F51214ALH'
df['ID'].loc[df['ID'] == 'Flat 16, 12-14 Alhambra Road, Southsea'] = 'F161214ALH'
df['ID'].loc[df['ID'] == 'Flat 12, 16-18 Alhambra Road, Southsea'] = 'F121618ALH'
df['ID'].loc[df['ID'] == 'Flat 16, 16-18 Alhambra Road, Southsea'] = 'F161618ALH'

In [5]:
df=df.loc[df['ID'].notnull()]
df.tail(5)

,ID,Activity I D,Date Created,Item Description,Uploaded Invoice,Lettings Charge Group I D,Document Type,Document Number,Grouped Amount,Shared Html,Debit Amount,Credit Amount
31,F121618ALH,889247,2022-05-19 09:50:00,Rent for period 19/05/2022 - 18/06/2022 from M...,NaN,NaN,NaN,0,NaN,NaN,0.00,272.01
32,F121618ALH,889247,2022-05-19 09:50:00,"Management Fee at 7% - Flat 12, 16-18 Alhambra...",NaN,NaN,Invoice,351624,NaN,NaN,22.85,0.00
33,F121618ALH,889252,2022-05-19 09:55:00,Amount payable to Ms Ivana Valentino - Flat 12...,NaN,NaN,Statement,265221,NaN,NaN,249.16,0.00
34,F121618ALH,890834,2022-05-28 00:32:00,"Legislation & Compliance - Flat 12, 16-18 Alh...",NaN,NaN,Invoice,352914,NaN,NaN,6.00,0.00
35,F161618ALH,890834,2022-05-28 00:32:00,"Legislation & Compliance - Flat 16, 16-18 Alha...",NaN,NaN,Invoice,353112,NaN,NaN,6.00,0.00

In [6]:
df.to_csv(output_file, index=False)